Revit 2026 API

# DividedPathDistance Property

---

The distance between points that are distributed along the path according to the selected layout. When the layout is set to 'FixedDistance' this value can be set to desired distance. The measurement type determines how the distance is measured.

**Namespace:** Autodesk.Revit.DB**Assembly:** RevitAPI (in RevitAPI.dll) Version: 26.0.4.0 (26.0.4.0)

```csharp
public double Distance { get; set; }
```
```vb
Public Property Distance As Double
	Get
	Set
```
```cpp
public:
property double Distance {
	double get ();
	void set (double value);
}
```
```fsharp
member Distance : float with get, set
```

#### Property Value

Double

| Exception | Condition |
| --- | --- |
| ArgumentOutOfRangeException | When setting this property: The distance is too small. |
| InvalidOperationException | When setting this property: The distance can only be set when the layout of this DividedPath is set to 'FixedDistance' or 'None'. |

This does not take into account points obtained by intersections with other elements. When the layout is set to 'None' the distance is the value that would be used by the 'FixedDistance' layout.

#### Reference

DividedPath Class

Autodesk.Revit.DB Namespace